test_cases/cylinder2D_variable_intake/Allrun.singularity
#!/bin/bash
cd "${0%/*}" || exit     # run from this directory
. ../../functions        # singularity run functions
#------------------------------------------------------------------------------

# dummy file for post-processing with paraview
touch post.foam

# mesh creation
singularityRun blockMesh

cp -r 0.org 0

# decompose and run case
singularityRun decomposePar
singularityRunParallel -np 10 renumberMesh -parallel -overwrite
singularityRunParallel -np 10 pimpleFoam -parallel

#------------------------------------------------------------------------------
